app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY title, asc
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies"
---
  def index
	sort=params[:sort_by]||nil
	case sort
	when 'title'
	@movies=Movie.order(:title)
	@title_header='hilite'
	when 'release_date'
	@movies=Movie.order(:release_date)
	@release_date_header='hilite'
	when nil
    @movies = Movie.all